//-------------------------------------------------------------------------------------//
//œô¨Íœô¨âœô¨Þœô¨â œô¨äœô¨Ðœô¨Ùœô¨Û œô¨ïœô¨Òœô¨Ûœô¨ïœô¨Õœô¨âœô¨áœô¨ï œô¨çœô¨Ðœô¨áœô¨âœô¨ìœô¨î œô¨ßœô¨àœô¨Þœô¨Õœô¨Úœô¨âœô¨Ð Exspecto 2006œô¨Ó.
//Module: CClientSocket class
//Author: Parshin Dmitry
//Description: œô¨ºœô¨Ûœô¨Ðœô¨áœô¨á, œô¨àœô¨Õœô¨Ðœô¨Ûœô¨Øœô¨×œô¨ãœô¨îœô¨éœô¨Øœô¨Ù œô¨Úœô¨Ûœô¨Øœô¨Õœô¨Ýœô¨âœô¨áœô¨Úœô¨ãœô¨î œô¨çœô¨Ðœô¨áœô¨âœô¨ì œô¨áœô¨Þœô¨Úœô¨Õœô¨âœô¨Þœô¨Ò
//-------------------------------------------------------------------------------------//
#ifndef CCLIENTSOCKET_H_
#define CCLIENTSOCKET_H_

#include "Socket.h"

class CClientSocket: public CSocket
{
public:

	//œô¨ºœô¨Þœô¨Ýœô¨áœô¨âœô¨àœô¨ãœô¨Úœô¨âœô¨Þœô¨à
	//iType - œô¨âœô¨Øœô¨ß œô¨áœô¨Þœô¨Úœô¨Õœô¨âœô¨Ð, œô¨Òœô¨Þœô¨×œô¨Üœô¨Þœô¨Öœô¨Ýœô¨ëœô¨Õ œô¨×œô¨Ýœô¨Ðœô¨çœô¨Õœô¨Ýœô¨Øœô¨ï - SOCK_STREAM œô¨Ø SOCK_DGRAM
	//bBlocking - œô¨Ñœô¨Ûœô¨Þœô¨Úœô¨Øœô¨àœô¨ãœô¨îœô¨éœô¨Øœô¨Ù œô¨Ûœô¨Øœô¨Ñœô¨Þ œô¨Ýœô¨Õ œô¨Ñœô¨Ûœô¨Þœô¨Úœô¨Øœô¨àœô¨ãœô¨îœô¨éœô¨Øœô¨Ù œô¨áœô¨Þœô¨Úœô¨Õœô¨â
	CClientSocket( int iType = SOCK_STREAM, bool bBlocking = true );

	~CClientSocket( void );


	//œô¨Áœô¨Þœô¨Õœô¨Ôœô¨Øœô¨Ýœô¨Õœô¨Ýœô¨Øœô¨Õ œô¨á strAddr:iPort,œô¨Óœô¨Ôœô¨Õ sAddr - œô¨Øœô¨Üœô¨ï œô¨ãœô¨Ôœô¨Ðœô¨Ûœô¨Õœô¨Ýœô¨Ýœô¨Þœô¨Óœô¨Þ œô¨åœô¨Þœô¨áœô¨âœô¨Ð,œô¨Ûœô¨Øœô¨Ñœô¨Þ œô¨Õœô¨Óœô¨Þ IP-œô¨Ðœô¨Ôœô¨àœô¨Õœô¨áœô¨á
	//								 iPort - œô¨ßœô¨Þœô¨àœô¨â, œô¨Ú œô¨Úœô¨Þœô¨âœô¨Þœô¨àœô¨Þœô¨Üœô¨ã œô¨Ýœô¨Õœô¨Þœô¨Ñœô¨åœô¨Þœô¨Ôœô¨Øœô¨Üœô¨Þ œô¨ßœô¨Þœô¨Ôœô¨Úœô¨Ûœô¨îœô¨çœô¨Øœô¨âœô¨ìœô¨áœô¨ï
	void Connect( std::string strAddr, int iPort );

private:
	CClientSocket( const CClientSocket& );
	CClientSocket& operator=( const CClientSocket& );
};

#endif
