//-------------------------------------------------------------------------------------//
//œô¨Íœô¨âœô¨Þœô¨â œô¨äœô¨Ðœô¨Ùœô¨Û œô¨ïœô¨Òœô¨Ûœô¨ïœô¨Õœô¨âœô¨áœô¨ï œô¨çœô¨Ðœô¨áœô¨âœô¨ìœô¨î œô¨ßœô¨àœô¨Þœô¨Õœô¨Úœô¨âœô¨Ð Exspecto 2006œô¨Ó.
//Module: CLog class
//Author: Bezborodov Dmitry
//Description: œô¨ºœô¨Ûœô¨Ðœô¨áœô¨á, œô¨àœô¨Õœô¨Ðœô¨Ûœô¨Øœô¨×œô¨ãœô¨îœô¨éœô¨Øœô¨Ù œô¨äœô¨ãœô¨Ýœô¨Úœô¨æœô¨Øœô¨Ø œô¨áœô¨Øœô¨áœô¨âœô¨Õœô¨Üœô¨ë œô¨Öœô¨ãœô¨àœô¨Ýœô¨Ðœô¨Ûœô¨Øœô¨àœô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Øœô¨ï
//-------------------------------------------------------------------------------------//
#ifndef _CLOG_H
#define _CLOG_H
#include <string>
#include "Singleton.hpp"
#ifdef WIN32
#include "windows.h"
#else
#define BYTE unsigned char
#endif

/*
 * œô¨ºœô¨Ûœô¨Ðœô¨áœô¨á Log œô¨ïœô¨Òœô¨Ûœô¨ïœô¨Õœô¨âœô¨áœô¨ï Singleton-œô¨Þœô¨Ü( œô¨áœô¨Ü. œô¨ßœô¨Ðœô¨âœô¨âœô¨Õœô¨àœô¨Ý œô¨ßœô¨àœô¨Þœô¨Õœô¨Úœô¨âœô¨Øœô¨àœô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Øœô¨ï Singleton )
 * œô¨³œô¨Ðœô¨àœô¨Ðœô¨Ýœô¨âœô¨Øœô¨àœô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Ýœô¨Þ œô¨áœô¨ãœô¨éœô¨Õœô¨áœô¨âœô¨Òœô¨ãœô¨Õœô¨â œô¨âœô¨Þœô¨Ûœô¨ìœô¨Úœô¨Þ œô¨Þœô¨Ôœô¨Øœô¨Ý œô¨íœô¨Úœô¨×œô¨Õœô¨Üœô¨ßœô¨Ûœô¨ïœô¨à œô¨íœô¨âœô¨Þœô¨Óœô¨Þ œô¨Úœô¨Ûœô¨Ðœô¨áœô¨áœô¨Ð, œô¨Ôœô¨Þœô¨áœô¨âœô¨ãœô¨ß œô¨Ú
 * œô¨Ýœô¨Õœô¨Üœô¨ã œô¨Þœô¨áœô¨ãœô¨éœô¨Õœô¨áœô¨âœô¨Òœô¨Ûœô¨ïœô¨Õœô¨âœô¨áœô¨ï œô¨çœô¨Õœô¨àœô¨Õœô¨× œô¨Üœô¨Õœô¨âœô¨Þœô¨Ô instance()
 *
 * œô¨¿œô¨àœô¨Øœô¨Üœô¨Õœô¨à.
 *
 * œô¨Ò œô¨Ûœô¨îœô¨Ñœô¨Þœô¨Ü œô¨Üœô¨Þœô¨Ôœô¨ãœô¨Ûœô¨Õ
 *
 * #include "CLog.h"
 * ...
 * Log::instance().Trace( 10, "LALALA" );
 * ...
 */
class CLog
{
public:
	CLog();
	~CLog();

	//œô¨ßœô¨Þœô¨×œô¨Òœô¨Þœô¨Ûœô¨ïœô¨Õœô¨â œô¨Øœô¨×œô¨Üœô¨Õœô¨Ýœô¨Øœô¨âœô¨ì œô¨Øœô¨Üœô¨ï œô¨Üœô¨Þœô¨Ôœô¨ãœô¨Ûœô¨ï, œô¨Øœô¨× œô¨Úœô¨Þœô¨âœô¨Þœô¨àœô¨Þœô¨Óœô¨Þ œô¨äœô¨Þœô¨àœô¨Üœô¨Øœô¨àœô¨ãœô¨Õœô¨âœô¨áœô¨ï œô¨Øœô¨Üœô¨ï œô¨äœô¨Ðœô¨Ùœô¨Ûœô¨Ð
	//œô¨ßœô¨Þ œô¨ãœô¨Üœô¨Þœô¨Ûœô¨çœô¨Ðœô¨Ýœô¨Øœô¨î œô¨Øœô¨Üœô¨ï œô¨Üœô¨Þœô¨Ôœô¨ãœô¨Ûœô¨ï œô¨Òœô¨ëœô¨ïœô¨áœô¨Ýœô¨ïœô¨Õœô¨âœô¨áœô¨ï œô¨á œô¨ßœô¨Þœô¨Üœô¨Þœô¨éœô¨ìœô¨î œô¨áœô¨Øœô¨áœô¨âœô¨Õœô¨Üœô¨Ýœô¨Þœô¨Ù œô¨äœô¨ãœô¨Ýœô¨Úœô¨æœô¨Øœô¨Ø
	//GetModuleFileName, œô¨Øœô¨Üœô¨Õœô¨Õœô¨â œô¨áœô¨Üœô¨ëœô¨áœô¨Û œô¨Òœô¨ëœô¨×œô¨ëœô¨Òœô¨Ðœô¨âœô¨ì œô¨Ôœô¨Ûœô¨ï dll œô¨çœô¨âœô¨Þœô¨Ñœô¨ë œô¨Ûœô¨Þœô¨Ó œô¨Üœô¨Þœô¨Ôœô¨ãœô¨Ûœô¨ï dll
	//œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨ëœô¨Òœô¨Ðœô¨Ûœô¨áœô¨ï œô¨Ò œô¨Þœô¨âœô¨Ôœô¨Õœô¨Ûœô¨ìœô¨Ýœô¨ëœô¨Ù œô¨äœô¨Ðœô¨Ùœô¨Û
	void SetModuleName( const std::string& strModuleName );

	//œô¨¼œô¨Õœô¨âœô¨Þœô¨Ô œô¨Øœô¨áœô¨ßœô¨Þœô¨Ûœô¨ìœô¨×œô¨ãœô¨Õœô¨âœô¨áœô¨ï œô¨Ôœô¨Ûœô¨ï œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø œô¨äœô¨Þœô¨àœô¨Üœô¨Ðœô¨âœô¨Øœô¨àœô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Ýœô¨Þœô¨Ù œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø œô¨Ò œô¨Öœô¨ãœô¨àœô¨Ýœô¨Ðœô¨Û
	//	iLevel - œô¨ßœô¨àœô¨Øœô¨Þœô¨àœô¨Øœô¨âœô¨Õœô¨â œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø, œô¨Òœô¨áœô¨Õ œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø œô¨á œô¨ßœô¨àœô¨Øœô¨Þœô¨àœô¨Øœô¨âœô¨Õœô¨âœô¨Þœô¨Ü > œô¨ãœô¨áœô¨âœô¨Ðœô¨Ýœô¨Þœô¨Òœô¨Ûœô¨Õœô¨Ýœô¨Ýœô¨Þœô¨Óœô¨Þ œô¨Ýœô¨Õ œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨ëœô¨Òœô¨Ðœô¨îœô¨âœô¨áœô¨ï œô¨Ò œô¨Öœô¨ãœô¨àœô¨Ýœô¨Ðœô¨Û
	//	trace_text - œô¨áœô¨âœô¨àœô¨Þœô¨Úœô¨Ð, œô¨áœô¨Þœô¨Ôœô¨Õœô¨àœô¨Öœô¨Ðœô¨éœô¨Ðœô¨ï œô¨äœô¨Þœô¨àœô¨Üœô¨Ðœô¨â œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø (œô¨Ðœô¨Ýœô¨Ðœô¨Ûœô¨Þœô¨Óœô¨Øœô¨çœô¨Ýœô¨ëœô¨Ù printf)
	//	... - œô¨Ðœô¨àœô¨Óœô¨ãœô¨Üœô¨Õœô¨Ýœô¨âœô¨ë œô¨äœô¨Þœô¨àœô¨Üœô¨Ðœô¨âœô¨Øœô¨àœô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Øœô¨ï
	void Trace(int iLevel, char* trace_text, ...);

	//œô¨¼œô¨Õœô¨âœô¨Þœô¨Ô œô¨Øœô¨áœô¨ßœô¨Þœô¨Ûœô¨ìœô¨×œô¨ãœô¨Õœô¨âœô¨áœô¨ï œô¨Ôœô¨Ûœô¨ï œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø œô¨äœô¨Þœô¨àœô¨Üœô¨Ðœô¨âœô¨Øœô¨àœô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Ýœô¨Þœô¨Ù œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø œô¨Ò œô¨Öœô¨ãœô¨àœô¨Ýœô¨Ðœô¨Û, œô¨á œô¨Ôœô¨Þœô¨Ñœô¨Ðœô¨Òœô¨Ûœô¨Õœô¨Ýœô¨Øœô¨Õœô¨Ü
	//œô¨Ôœô¨Ðœô¨Üœô¨ßœô¨Ð œô¨ãœô¨çœô¨Ðœô¨áœô¨âœô¨Úœô¨Ð œô¨ßœô¨Ðœô¨Üœô¨ïœô¨âœô¨Ø
	//	iLevel - œô¨ßœô¨àœô¨Øœô¨Þœô¨àœô¨Øœô¨âœô¨Õœô¨â œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø, œô¨Òœô¨áœô¨Õ œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø œô¨á œô¨ßœô¨àœô¨Øœô¨Þœô¨àœô¨Øœô¨âœô¨Õœô¨âœô¨Þœô¨Ü > œô¨ãœô¨áœô¨âœô¨Ðœô¨Ýœô¨Þœô¨Òœô¨Ûœô¨Õœô¨Ýœô¨Ýœô¨Þœô¨Óœô¨Þ œô¨Ýœô¨Õ œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨ëœô¨Òœô¨Ðœô¨îœô¨âœô¨áœô¨ï œô¨Ò œô¨Öœô¨ãœô¨àœô¨Ýœô¨Ðœô¨Û
	//	pbDumpData, iDataSize - œô¨ãœô¨Úœô¨Ðœô¨×œô¨Ðœô¨âœô¨Õœô¨Ûœô¨ì œô¨Ýœô¨Ð œô¨ãœô¨ç-œô¨Ú œô¨ßœô¨Ðœô¨Üœô¨ïœô¨âœô¨Ø œô¨Ø œô¨Õœô¨Óœô¨Þ œô¨àœô¨Ðœô¨×œô¨Üœô¨Õœô¨à
	//	trace_text - œô¨áœô¨âœô¨àœô¨Þœô¨Úœô¨Ð, œô¨áœô¨Þœô¨Ôœô¨Õœô¨àœô¨Öœô¨Ðœô¨éœô¨Ðœô¨ï œô¨äœô¨Þœô¨àœô¨Üœô¨Ðœô¨â œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨Ø (œô¨Ðœô¨Ýœô¨Ðœô¨Ûœô¨Þœô¨Óœô¨Øœô¨çœô¨Ýœô¨ëœô¨Ù printf)
	//	... - œô¨Ðœô¨àœô¨Óœô¨ãœô¨Üœô¨Õœô¨Ýœô¨âœô¨ë œô¨äœô¨Þœô¨àœô¨Üœô¨Ðœô¨âœô¨Øœô¨àœô¨Þœô¨Òœô¨Ðœô¨Ýœô¨Øœô¨ï
	void Dump(int iLevel, BYTE* pbDumpData, int iDataSize, char* about, ...);

	void SetLoglevel( int iLoglevel );

private:
	CLog( const CLog& );
	CLog& operator=( const CLog& );

	//œô¨Øœô¨Üœô¨ï œô¨äœô¨Ðœô¨Ùœô¨Ûœô¨Ð œô¨Ûœô¨Þœô¨Óœô¨Ð
	std::string m_strFileName;

	//œô¨Úœô¨àœô¨Øœô¨âœô¨Øœô¨çœô¨Õœô¨áœô¨Úœô¨Ðœô¨ï œô¨áœô¨Õœô¨Úœô¨æœô¨Øœô¨ï œô¨Ýœô¨Ð œô¨×œô¨Ðœô¨ßœô¨Øœô¨áœô¨ì œô¨Ò œô¨äœô¨Ðœô¨Ùœô¨Û
	CMutex m_mutex;

	int m_iLogLevel;
};

typedef CSingleton< CLog > Log;

#endif

