//------------------------------------------------------------------------------------//
//œô¨úœô¨äœô¨¡œô¨½œô¨úœô¨äœô¨¡œô¨Òœô¨úœô¨äœô¨¡œô¨Îœô¨úœô¨äœô¨¡œô¨Ò œô¨úœô¨äœô¨¡œô¨Ôœô¨úœô¨äœô¨¡œô¨Àœô¨úœô¨äœô¨¡œô¨Éœô¨úœô¨äœô¨¡œô¨Ë œô¨úœô¨äœô¨¡œô¨ßœô¨úœô¨äœô¨¡œô¨Âœô¨úœô¨äœô¨¡œô¨Ëœô¨úœô¨äœô¨¡œô¨ßœô¨úœô¨äœô¨¡œô¨Åœô¨úœô¨äœô¨¡œô¨Òœô¨úœô¨äœô¨¡œô¨Ñœô¨úœô¨äœô¨¡œô¨ß œô¨úœô¨äœô¨¡œô¨×œô¨úœô¨äœô¨¡œô¨Àœô¨úœô¨äœô¨¡œô¨Ñœô¨úœô¨äœô¨¡œô¨Òœô¨úœô¨äœô¨¡œô¨Üœô¨úœô¨äœô¨¡œô¨Ş œô¨úœô¨äœô¨¡œô¨Ïœô¨úœô¨äœô¨¡œô¨Ğœô¨úœô¨äœô¨¡œô¨Îœô¨úœô¨äœô¨¡œô¨Åœô¨úœô¨äœô¨¡œô¨Êœô¨úœô¨äœô¨¡œô¨Òœô¨úœô¨äœô¨¡œô¨À Exspecto 2006œô¨úœô¨äœô¨¡œô¨Ã.
//Module: CAgent class
//Author: Parshin Dmitry
//Description: œô¨úœô¨äœô¨¡œô¨ôœô¨úœô¨äœô¨¡œô¨Ëœô¨úœô¨äœô¨¡œô¨Àœô¨úœô¨äœô¨¡œô¨Ñœô¨úœô¨äœô¨¡œô¨Ñ, œô¨úœô¨äœô¨¡œô¨Ğœô¨úœô¨äœô¨¡œô¨Åœô¨úœô¨äœô¨¡œô¨Àœô¨úœô¨äœô¨¡œô¨Ëœô¨úœô¨äœô¨¡œô¨Èœô¨úœô¨äœô¨¡œô¨Çœô¨úœô¨äœô¨¡œô¨Óœô¨úœô¨äœô¨¡œô¨Şœô¨úœô¨äœô¨¡œô¨Ùœô¨úœô¨äœô¨¡œô¨Èœô¨úœô¨äœô¨¡œô¨É œô¨úœô¨äœô¨¡œô¨Ôœô¨úœô¨äœô¨¡œô¨Óœô¨úœô¨äœô¨¡œô¨Íœô¨úœô¨äœô¨¡œô¨Êœô¨úœô¨äœô¨¡œô¨Öœô¨úœô¨äœô¨¡œô¨Èœô¨úœô¨äœô¨¡œô¨È œô¨úœô¨äœô¨¡°œô¨úœô¨äœô¨¡œô¨Ãœô¨úœô¨äœô¨¡œô¨Åœô¨úœô¨äœô¨¡œô¨Íœô¨úœô¨äœô¨¡œô¨Òœô¨úœô¨äœô¨¡œô¨À
//-------------------------------------------------------------------------------------//
#ifndef AGENT_H_
#define AGENT_H_

#include "ServerSocket.h"
#include "ClientSocket.h"
#include "Packet.h"
#include "CScanner.h"
#include <set>

#include <map>
#include <vector>
#include <deque>
#include <string>
#include "SmartPtr.hpp"
#include "Event.h"
#include "CTask.h"
#include "ServerHandler.h"
#include "ConnectionHandler.h"


//-----------------------------------------------------------------------------------------------------------------
//-----------------------------------------------------CAgent------------------------------------------------------
//-----------------------------------------------------------------------------------------------------------------


class CAgent
{
public:

	CAgent();

	~CAgent(void);

	bool IsStarted(){ return m_bStarted; }

private:

	CAgent( const CAgent& );
	CAgent& operator=( const CAgent& );

	bool m_bStarted;

	std::vector< SmartPtr< CConnectionHandler > > m_vecConnections;

	SmartPtr< CServerSocket > m_pMsgSock;

	SmartPtr< CClientSocket > m_pEventSock;

	//œô¨úœô¨äœô¨¡°œô¨úœô¨äœô¨¡œô¨Äœô¨úœô¨äœô¨¡œô¨Ğœô¨úœô¨äœô¨¡œô¨Åœô¨úœô¨äœô¨¡œô¨Ñ œô¨úœô¨äœô¨¡œô¨Ïœô¨úœô¨äœô¨¡œô¨Ëœô¨úœô¨äœô¨¡œô¨Àœô¨úœô¨äœô¨¡œô¨Íœô¨úœô¨äœô¨¡œô¨Èœô¨úœô¨äœô¨¡œô¨Ğœô¨úœô¨äœô¨¡œô¨Îœô¨úœô¨äœô¨¡œô¨Âœô¨úœô¨äœô¨¡œô¨Ùœô¨úœô¨äœô¨¡œô¨Èœô¨úœô¨äœô¨¡œô¨Êœô¨úœô¨äœô¨¡œô¨À
	std::string m_strSchedulerAddress;

	class CListenThreadTask: public CThreadTask
	{
    public:

        CListenThreadTask( CAgent* pAgent ):m_pAgent( pAgent ){}

        virtual void Execute( CEvent& CancelEv );
    private:

        CAgent* m_pAgent;
	};
	CThread m_ListenThread;
};

#endif
